{
    "HeaderComponent": {
        "SwitchTitleDark": "Escuro",
        "SwitchTitleLight": "Claro",
        "ButtonTitleOne": "Sobre Mim",
        "ButtonOne": "sobre mim",
        "ButtonTitleTwo": "Habilidades",
        "ButtonTwo": "habilidades",
        "ButtonTitleThree": "Projetos",
        "ButtonThree": "projetos"
    },
    "StartComponent": {
        "Paragraf": "Olá",
        "Hfirst": "Sou o Humberto Ribeiro",
        "Hsecond": "Desenvolvedor Full-Stack",
        "ImgAlt": "Imagem Perfil"
    },
    "AboutComponent": {
        "Hthird": "sobre mim",
        "ImgAlt": "Imagem Perfil",
        "ParagrafOne": "Olá!",
        "ParagrafSecond": "Me chamo Humberto Ribeiro e sou um desenvolvedor Full-Stack em formação!",
        "ParagrafThree": "Gosto MUITO da área de tecnologia, e tenho certeza que posso contribuir em qualquer time com as minhas habilidades.",
        "ParagrafFour": "Sou técnico em Informática desde 2002, Telecomunicações em 2016 e Desenvolvimento de Sistema em sistema Web 2021, iniciei em Análise e Desenvolvimento de Sistemas em 2025",
        "ParagrafFive": "Estou sempre me desafiando com novos projetos e participando de comunidades de programação para buscar feedback de outros desenvolvedoras e desenvolvedores.",
        "ParagrafSix": "Além de tentar ajudar essas pessoas com o que eu já aprendi.",
        "ParagrafSeven": "Ah, gosto de jogos, filmes, séries, animes e outras nerdices.",
        "LinkCv": "Veja meu CV"
    },
    "SkillsComponent": {
        "Hfourth": "habilidades",
        "DescriptionFirst": "HTML é a base fundamental para a criação de páginas web. Ele fornece a estrutura, a semântica e os elementos necessários para apresentar informações de forma organizada e acessível na web, além de permitir a criação de links e a incorporação de mídia. É uma linguagem essencial para qualquer desenvolvedor web!",
        "DescriptionSecond": "CSS é essencial para controlar o estilo e o design de páginas web, tornando possível criar layouts atraentes, responsivos e consistentes. Ele desempenha um papel fundamental na apresentação visual de conteúdo na web e é uma ferramenta essencial para desenvolvedores web e designers!",
        "DescriptionThird": "JavaScript é uma linguagem versátil que desempenha um papel fundamental no desenvolvimento web, aplicativos móveis e em uma variedade de outras aplicações. É uma das linguagens mais amplamente usadas no mundo da programação devido à sua flexibilidade e capacidade de criar experiências interativas na web!",
        "DescriptionFourth": "TypeScript é uma linguagem de programação de código aberto que é uma superconjunto do JavaScript. Isso significa que todo código JavaScript é também código válido em TypeScript. A principal diferença é que o TypeScript adiciona tipagem estática e outros recursos avançados, que não estão presentes no JavaScript tradicional!",
        "DescriptionFifth": "PHP (Hypertext Preprocessor) é uma linguagem de programação amplamente utilizada para desenvolvimento web, especialmente para a criação de sites dinâmicos e aplicações web. Aqui estão algumas características e informações importantes sobre o PHP: 1. **Linguagem de Script do Lado do Servidor**, 2. **Facilidade de Aprendizado**, 3. **Integração com Bancos de Dados** 4. **Ampla Comunidade e Suporte**, 5. **Frameworks Populares**, 6. **Funcionalidades de Segurança**, 7. **Compatibilidade com HTML**, 8. **Hospedagem Acessível**, 9. **Suporte a Programação Orientada a Objetos**!",
        "DescriptionSixth": "Tailwind CSS é um framework CSS utility-first (ou 'primeiro utilitário'), que permite que você crie designs personalizados diretamente no HTML, utilizando classes utilitárias predefinidas. Em vez de escrever estilos personalizados no CSS, você usa essas classes utilitárias para definir propriedades de estilo, como margens, espaçamentos, cores, fontes e outros aspectos de design!",
        "DescriptionSeventh": "GitHub é uma plataforma essencial para desenvolvedores de software e equipes de desenvolvimento, pois facilita o controle de versão, a colaboração, o compartilhamento de código e a gestão de projetos, contribuindo para a eficiência e a qualidade do desenvolvimento de software!",
        "DescriptionEighth": "Git é uma ferramenta fundamental no desenvolvimento de software, fornecendo controle de versão, colaboração em equipe, rastreamento de alterações e muitos outros recursos que tornam o desenvolvimento de software mais eficiente, seguro e colaborativo. É uma ferramenta essencial para desenvolvedores e equipes de desenvolvimento de software!",
        "DescriptionNinth": "React é uma biblioteca JavaScript desenvolvida pelo Facebook. É usada para construir interfaces de usuário (UI) interativas e reativas para aplicações web. O principal objetivo do React é facilitar a criação de componentes reutilizáveis e construir interfaces de usuário escaláveis. Além disso, o React introduz um paradigma de programação chamado de programação declarativa!",
        "DescriptionTenth": "Vite é uma ferramenta de construção e desenvolvimento para aplicações web, criada por Evan You, o criador do Vue.js. Ele se destaca por sua velocidade e eficiência, utilizando uma abordagem moderna para o desenvolvimento de projetos. Aqui estão algumas características principais do Vite: 1. **Desenvolvimento Rápido**, 2. **Construção Otimizada**, 3. **Suporte a Múltiplos Frameworks** 4. **Configuração Simples**, 5. **Plugins** Se você estiver pensando em usar Vite em seu próximo projeto seria uma ótima opção!",
        "DescriptionEleventh": "Next.js é um framework React desenvolvido pela Vercel que facilita a criação de aplicações web. Ele é conhecido por oferecer uma série de recursos que melhoram a experiência de desenvolvimento e o desempenho das aplicações. Aqui estão algumas das principais características do Next.js: 1. **Renderização Híbrida**, 2. **Geração de Sites Estáticos (SSG)**, 3. **Rotas Automáticas**, 4. **API Routes** 5. **Suporte a CSS e Sass**, 6. **Otimização de Imagens**, 7. **Desempenho e SEO**, 8. **Suporte a TypeScript** 9. **Ambiente de Desenvolvimento**, Essas características fazem do Next.js uma escolha popular para desenvolvedores que querem criar aplicações React de forma rápida e eficiente!",
        "DescriptionTwelfth": "Laravel é um framework de desenvolvimento web em PHP que se destaca pela sua elegância e simplicidade. Criado por Taylor Otwell em 2011, o Laravel foi projetado para facilitar o desenvolvimento de aplicações web, oferecendo uma série de recursos e ferramentas que ajudam a acelerar o processo de codificação. Algumas das características principais do Laravel incluem: 1. **Arquitetura MVC**, 2. **Roteamento Simples**,  3. **ORM Eloquent**, 4. **Sistema de Migrations**, 5. **Segurança**, 6. **Artisan**, 7. **Comunitária e Ecosystem**!",
        "DescriptionThirteenth": "PostgreSQL é um sistema de gerenciamento de banco de dados relacional de código aberto e altamente avançado. Ele é conhecido por sua robustez, escalabilidade e suporte a recursos avançados. Aqui estão algumas das principais características do PostgreSQL: Open Source, Compatibilidade com SQL, Extensibilidade, Suporte a ACID, Suporte a tipos de dados avançados, Procedimentos armazenados e funções, Indexação avançada, Replicação e alta disponibilidade, Comunidade ativa, Devido a essas características, o PostgreSQL é uma escolha popular para muitas aplicações, desde pequenas startups até grandes corporações!",
        "DescriptionFourteenth": "MariaDB é um sistema de gerenciamento de banco de dados relacional (RDBMS) que é um fork do MySQL, criado por alguns dos desenvolvedores originais do MySQL após a aquisição deste último pela Oracle. MariaDB é popular por ser uma alternativa de código aberto ao MySQL e oferece uma série de recursos e melhorias. Aqui estão algumas das características principais do MariaDB: 1. **Código Aberto**, 2. **Compatibilidade com MySQL**, 3. **Desempenho Aprimorado**, 4. **Recursos Avançados**, 5. **Segurança**, 6. **Replicação e Escalabilidade**, 7. **Comunidade Ativa**, 8. **Interface de Linha de Comando**, 9. **Interface Gráfica**!",
        "DescriptionFifteenth": "Prisma é uma ferramenta de ORM (Object-Relational Mapping) moderna e poderosa para Node.js e TypeScript, que facilita a interação com bancos de dados relacionais. Ele ajuda a mapear dados entre o banco de dados e a aplicação de forma mais intuitiva e segura. Aqui estão algumas das principais características e funcionalidades do Prisma: 1. **Cliente Prisma**, 2. **Prisma Migrate**, 3. **Prisma Studio**, 4. **Modelo de Dados Declarativo**, 5. **Suporte a Diversos Bancos de Dados**, 6. **Segurança e Validação**, 7. **Desempenho**, 8. **Integração com Ecosistema JavaScript/TypeScript**, 9. **Comunidade e Suporte**, No geral, o Prisma é uma ferramenta que visa simplificar e melhorar a experiência de desenvolvimento ao trabalhar com bancos de dados, oferecendo uma maneira moderna e eficiente de lidar com dados em aplicações Node.js e TypeScript!",
        "DescriptionSixteenth": "Express é um framework web para Node.js que facilita a criação de servidores e aplicações web. Ele é conhecido por sua simplicidade, flexibilidade e performance. Aqui estão alguns dos principais aspectos do Express: 1. **Minimalista e Flexível**, 2. **Middleware**, 3. **Roteamento**, 4. **Tratamento de Erros**, 5. **Suporte a View Engines**, 6. **Desempenho**, 7. **Comunidade e Ecossistema**, 8. **Documentação e Recursos**, Express é amplamente utilizado em aplicações Node.js, desde APIs simples até aplicações web complexas. Sua popularidade e flexibilidade o tornam uma escolha comum para desenvolvedores que buscam um framework leve e eficiente para construir aplicações de servidor!",
        "DescriptionSeventeenth": "Docker é uma plataforma que permite criar, implantar e gerenciar aplicativos em contêineres. Um contêiner é uma unidade leve e portátil que encapsula tudo o que um aplicativo precisa para rodar, incluindo código, bibliotecas e dependências. Isso garante que o aplicativo funcione de maneira consistente em diferentes ambientes, desde o desenvolvimento até a produção. 1. **Isolamento**, 2. **Portabilidade**, 3. **Eficiência**, 4. **Facilidade de uso**, 5. **Escalabilidade**!",
        "DescriptionEighteenth": "A Amazon Web Services (AWS) é uma plataforma de serviços de computação em nuvem fornecida pela Amazon. Ela oferece uma ampla gama de serviços como infraestrutura de TI, armazenamento de dados, redes, segurança, machine learning, análise de dados, bancos de dados e muito mais. Esses serviços são oferecidos através da internet, permitindo que empresas de diferentes tamanhos e indústrias escalem suas operações sem a necessidade de investir em hardware físico. 1. **EC2 (Elastic Compute Cloud)**: Oferece servidores virtuais para rodar aplicações, 2. **S3 (Simple Storage Service)**: Serviço de armazenamento de objetos, onde é possível armazenar grandes volumes de dados de forma escalável, 3. **RDS (Relational Database Service)**: Serviço gerenciado para bancos de dados relacionais, 4. **Lambda**: Execução de código sem a necessidade de gerenciar servidores (computação serverless), 5. **VPC (Virtual Private Cloud)**: Criação de redes privadas na nuvem!",
        "DescriptionNineteenth": "Electron é um framework que te permite criar aplicações desktop com JavaScript, HTML e CSS. Ao embutir o Chromium e o Node.js no seu binário, o Electron permite que você mantenha uma base de código para JavaScript e crie aplicações multiplataforma que funcionam no Windows macOS e Linux - sem a necessidade de ter experiência em desenvolvimento nativo!",
        "DescriptionTwentyth": "Styled Components é uma biblioteca de CSS-in-JS para React que permite criar estilos diretamente dentro do JavaScript, usando componentes estilizados. Em vez de escrever estilos em arquivos CSS separados, você define o visual dos elementos dentro do próprio código, utilizando template literals. Assim, cada componente já carrega seu estilo junto, evitando conflitos de classes e deixando a estilização mais organizada e dinâmica!",
        "ButtonPlus": "Carregar mais",
        "ButtonClose": "Fechar"
    },
    "ProjectComponent": {
        "Hfifth": "Meus projetos",
        "ParagrafOne": "Projeto desenvolvido por Humberto Ribeiro",
        "ParagrafSecond": "GitHub Repositório",
        "ParagrafFour": "Página",
        "DescriptionFirst": "Projeto desenvolvido com Framework Next.Js, Shadcn.ui, Tailwind, Auth.Js v5, TypeScript e PostgreSql >> Vercel <<",
        "TitleFirst": "Projeto App Next.js Starter Kit",
        "DescriptionSecond": "Projeto desenvolvido com Framework Next.Js, Shadcn.ui, Tailwind, TypeScript e PostgreSql, >> Vercel <<",
        "TitleSecond": "Projeto App Next.js Kits Starter",
        "DescriptionThird": "Projeto desenvolvido com Framework Next.Js, Shadcn.ui, Tailwind, TypeScript e PostgreSql >> Vercel <<",
        "TitleThird": "Projeto App Next.js Start Kit",
        "DescriptionFourth": "Projeto desenvolvido com Framework Next.Js, Shadcn.ui, Tailwind, TypeScript e PostgreSql >> Vercel <<",
        "TitleFourth": "Projeto pessoal gestão de coleta de Doações",
        "DescriptionFifth": "Projeto desenvolvido com HTML, CSS, JavaScript, API, React+Vite, >> Vercel <<",
        "TitleFifth": "Projeto de Teste Dev em Dobro PokéDex",
        "DescriptionSixth": "Projeto desenvolvido com Framework Next.Js,Shadcn.ui Tailwind, TypeScript e PostgreSql >> Vercel <<",
        "TitleSixth": "Projeto App Next.js Kit Starter",
        "DescriptionSeventh": "Projeto desenvolvido com Framework Next.Js, Shadcn.ui, Tailwind, TypeScript e PostgreSql >> Vercel <<",
        "TitleSeventh": "Projeto de teste Consumo de Api",
        "DescriptionEighth": "Projeto desenvolvido com Framework Next.Js,Shadcn.ui Tailwind, TypeScript e PostgreSql >> Vercel <<",
        "TitleEighth": "Projeto App Next.js Start Kits"
    },
    "FooterComponent": {
        "ParagrafOneFirst": "Há",
        "ParagrafOneSecond": "anos,",
        "ParagrafSecond": "na área de Tecnologia.",
        "Hsexth": "Me envie uma mensagem!"
    },
    "NotFound": {
        "TextTitle": "Página não encontrada",
        "TextParagraf": "Desculpe, não conseguimos encontrar a página que você está procurando."
    }
}